--- a/README.md
+++ b/README.md
@@ -113,84 +113,91 @@
 关系图：
 
 ```
-graph TB
-GameObject
-AIMgr
-Fsm
-SubFsm
-State((State))
-Action
-GameObject---AIMgr
-AIMgr---Fsm
-Fsm-->SubFsm
-Fsm-->State
-SubFsm-->State
-State-->Action
-SubFsm-->SubFsm
-SubFsm-->Action
-Action-.->Action
-State-->|Transition|State
-SubFsm-->|Transition|State
+digraph JerryFsm {
+State[shape = box, color = blue]
+GameObject->AIMgr
+AIMgr->Fsm
+Fsm->SubFsm
+Fsm->State
+SubFsm->SubFsm
+SubFsm->State
+SubFsm->State[label = "Transition"]
+SubFsm->Action
+State->State[label = "Transition"]
+State->Action
+Action->Action
+}
 ```
+
+![image](http://odk2uwdl8.bkt.clouddn.com/2016-07-26-jerry-fsm_00.png)
 
 ## 衍化过程
 
 **最初**
 
 ```
-graph TB
-Fsm
-State1((State1))
-State2((State2))
-Fsm-->State1
-Fsm-.->State2
-State1-->State2
-State2-->State1
+digraph JerryFsm {
+State1[shape = box, color = blue]
+State2[shape = box, color = blue]
+Fsm->State1
+Fsm->State2
+State1->State2
+State2->State1
+}
 ```
+
+![image](http://odk2uwdl8.bkt.clouddn.com/2016-07-26-jerry-fsm_01.png)
 
 **为了丰富和共用State的行为引入Action**
 
 ```
-graph TB
-Fsm
-State1((State1))
-State2((State2))
-Fsm-->State1
-Fsm-.->State2
-State1-->State2
-State2-->State1
-State1-->Action1
-State1-->Action2
+digraph JerryFsm {
+State1[shape = box, color = blue]
+State2[shape = box, color = blue]
+Fsm->State1
+Fsm->State2
+State1->State2
+State2->State1
+State1->Action1
+State1->Action2
+}
 ```
+
+![image](http://odk2uwdl8.bkt.clouddn.com/2016-07-26-jerry-fsm_02.png)
 
 **为了丰富和共用跳转条件引入Trasition**
 
 ```
-graph TB
-Fsm
-State1((State1))
-State2((State2))
-Fsm-->State1
-Fsm-.->State2
-State1-->|Transition1|State2
-State2-->|Transition1|State1
+digraph JerryFsm {
+State1[shape = box, color = blue]
+State2[shape = box, color = blue]
+Fsm->State1
+Fsm->State2
+State1->State2[label = "Transition1"]
+State2->State1[label = "Transition1"]
+}
 ```
+
+![image](http://odk2uwdl8.bkt.clouddn.com/2016-07-26-jerry-fsm_03.png)
 
 **为了可以监管局部引入SubFsm**
 
 ```
-graph TB
-Fsm
-State1((State1))
-State2((State2))
-State3((State3))
-Fsm-->State1
-Fsm-.->SubFsm1
-State1-->State2
-State2-->State1
-SubFsm1-->State2
-SubFsm1-.->State3
+digraph JerryFsm {
+State1[shape = box, color = blue]
+State2[shape = box, color = blue]
+State3[shape = box, color = blue]
+Fsm->State1
+Fsm->State2
+Fsm->SubFsm1
+State1->State2[label = "tr"]
+State2->State1[label = "tr"]
+SubFsm1->State2[label = "tr"]
+SubFsm1->State3
+}
 ```
+
+![image](http://odk2uwdl8.bkt.clouddn.com/2016-07-26-jerry-fsm_04.png)
 
